
# State **`s3://foo-bucket/path/to/key.state`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |       2 |          1 |           2 |
## Affected resources by action

|  Action  | Resources                                                                |
|:--------:|:-------------------------------------------------------------------------|
|    🟢     | `module.repos["test"].github_repository.repo`                            |
|    🟢     | `module.repos["test"].github_team_repository.dev`                        |
|    🟡     | `module.repos["infrahouse-toolkit"].github_repository.repo`              |
|    🔴     | `module.repos["cookiecutter-github-control"].github_repository.repo`     |
|    🔴     | `module.repos["cookiecutter-github-control"].github_team_repository.dev` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.repos["cookiecutter-github-control"].github_repository.repo will be destroyed
  # (because module.repos["cookiecutter-github-control"] is not in configuration)
  - resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "Template for a GitHub Control repository" -> null
      - etag                        = "W/\"8b4a792bc1474d381caaa63b76668993b4adc42ae76ed53d6886d8562ebb0c67\"" -> null
      - full_name                   = "infrahouse/cookiecutter-github-control" -> null
      - git_clone_url               = "git://github.com/infrahouse/cookiecutter-github-control.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/infrahouse/cookiecutter-github-control" -> null
      - http_clone_url              = "https://github.com/infrahouse/cookiecutter-github-control.git" -> null
      - id                          = "cookiecutter-github-control" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "cookiecutter-github-control" -> null
      - node_id                     = "R_kgDOI528zg" -> null
      - private                     = false -> null
      - repo_id                     = 597540046 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:infrahouse/cookiecutter-github-control.git" -> null
      - svn_url                     = "https://github.com/infrahouse/cookiecutter-github-control" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null

      - security_and_analysis {

          - secret_scanning {
              - status = "disabled" -> null
            }

          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # module.repos["cookiecutter-github-control"].github_team_repository.dev will be destroyed
  # (because module.repos["cookiecutter-github-control"] is not in configuration)
  - resource "github_team_repository" "dev" {
      - etag       = "W/\"8043f81b19693f6c1a72d21bb8dc03859c98bf78bfbe79782bfe13fa813992ca\"" -> null
      - id         = "7332815:cookiecutter-github-control" -> null
      - permission = "push" -> null
      - repository = "cookiecutter-github-control" -> null
      - team_id    = "7332815" -> null
    }

  # module.repos["infrahouse-toolkit"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ description                 = "InfraHouse Toolkit" -> "InfraHouse Toolkit1"
        id                          = "infrahouse-toolkit"
        name                        = "infrahouse-toolkit"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["test"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Template for a GitHub Control repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "test"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # module.repos["test"].github_team_repository.dev will be created
  + resource "github_team_repository" "dev" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "test"
      + team_id    = "7332815"
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2Zvby1idWNrZXQvcGF0aC90by9rZXkuc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAic3Rkb3V0IjogIlRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb25cbnBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczpcbiAgKyBjcmVhdGVcbiAgfiB1cGRhdGUgaW4tcGxhY2VcbiAgLSBkZXN0cm95XG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG8gd2lsbCBiZSBkZXN0cm95ZWRcbiAgIyAoYmVjYXVzZSBtb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0gaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXG4gIC0gcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHtcbiAgICAgIC0gYWxsb3dfYXV0b19tZXJnZSAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBhbGxvd19tZXJnZV9jb21taXQgICAgICAgICAgPSB0cnVlIC0+IG51bGxcbiAgICAgIC0gYWxsb3dfcmViYXNlX21lcmdlICAgICAgICAgID0gdHJ1ZSAtPiBudWxsXG4gICAgICAtIGFsbG93X3NxdWFzaF9tZXJnZSAgICAgICAgICA9IHRydWUgLT4gbnVsbFxuICAgICAgLSBhbGxvd191cGRhdGVfYnJhbmNoICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGFyY2hpdmVkICAgICAgICAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gZGVmYXVsdF9icmFuY2ggICAgICAgICAgICAgID0gXCJtYWluXCIgLT4gbnVsbFxuICAgICAgLSBkZWxldGVfYnJhbmNoX29uX21lcmdlICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGRlc2NyaXB0aW9uICAgICAgICAgICAgICAgICA9IFwiVGVtcGxhdGUgZm9yIGEgR2l0SHViIENvbnRyb2wgcmVwb3NpdG9yeVwiIC0+IG51bGxcbiAgICAgIC0gZXRhZyAgICAgICAgICAgICAgICAgICAgICAgID0gXCJXL1xcXCI4YjRhNzkyYmMxNDc0ZDM4MWNhYWE2M2I3NjY2ODk5M2I0YWRjNDJhZTc2ZWQ1M2Q2ODg2ZDg1NjJlYmIwYzY3XFxcIlwiIC0+IG51bGxcbiAgICAgIC0gZnVsbF9uYW1lICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlL2Nvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiIC0+IG51bGxcbiAgICAgIC0gZ2l0X2Nsb25lX3VybCAgICAgICAgICAgICAgID0gXCJnaXQ6Ly9naXRodWIuY29tL2luZnJhaG91c2UvY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sLmdpdFwiIC0+IG51bGxcbiAgICAgIC0gaGFzX2Rpc2N1c3Npb25zICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBoYXNfZG93bmxvYWRzICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGhhc19pc3N1ZXMgICAgICAgICAgICAgICAgICA9IHRydWUgLT4gbnVsbFxuICAgICAgLSBoYXNfcHJvamVjdHMgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGhhc193aWtpICAgICAgICAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gaHRtbF91cmwgICAgICAgICAgICAgICAgICAgID0gXCJodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiAtPiBudWxsXG4gICAgICAtIGh0dHBfY2xvbmVfdXJsICAgICAgICAgICAgICA9IFwiaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sLmdpdFwiIC0+IG51bGxcbiAgICAgIC0gaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiAtPiBudWxsXG4gICAgICAtIGlzX3RlbXBsYXRlICAgICAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gbWVyZ2VfY29tbWl0X21lc3NhZ2UgICAgICAgID0gXCJQUl9USVRMRVwiIC0+IG51bGxcbiAgICAgIC0gbWVyZ2VfY29tbWl0X3RpdGxlICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCIgLT4gbnVsbFxuICAgICAgLSBuYW1lICAgICAgICAgICAgICAgICAgICAgICAgPSBcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiIC0+IG51bGxcbiAgICAgIC0gbm9kZV9pZCAgICAgICAgICAgICAgICAgICAgID0gXCJSX2tnRE9JNTI4emdcIiAtPiBudWxsXG4gICAgICAtIHByaXZhdGUgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gcmVwb19pZCAgICAgICAgICAgICAgICAgICAgID0gNTk3NTQwMDQ2IC0+IG51bGxcbiAgICAgIC0gc3F1YXNoX21lcmdlX2NvbW1pdF9tZXNzYWdlID0gXCJDT01NSVRfTUVTU0FHRVNcIiAtPiBudWxsXG4gICAgICAtIHNxdWFzaF9tZXJnZV9jb21taXRfdGl0bGUgICA9IFwiQ09NTUlUX09SX1BSX1RJVExFXCIgLT4gbnVsbFxuICAgICAgLSBzc2hfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSBcImdpdEBnaXRodWIuY29tOmluZnJhaG91c2UvY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sLmdpdFwiIC0+IG51bGxcbiAgICAgIC0gc3ZuX3VybCAgICAgICAgICAgICAgICAgICAgID0gXCJodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiAtPiBudWxsXG4gICAgICAtIHRvcGljcyAgICAgICAgICAgICAgICAgICAgICA9IFtdIC0+IG51bGxcbiAgICAgIC0gdmlzaWJpbGl0eSAgICAgICAgICAgICAgICAgID0gXCJwdWJsaWNcIiAtPiBudWxsXG4gICAgICAtIHZ1bG5lcmFiaWxpdHlfYWxlcnRzICAgICAgICA9IGZhbHNlIC0+IG51bGxcblxuICAgICAgLSBzZWN1cml0eV9hbmRfYW5hbHlzaXMge1xuXG4gICAgICAgICAgLSBzZWNyZXRfc2Nhbm5pbmcge1xuICAgICAgICAgICAgICAtIHN0YXR1cyA9IFwiZGlzYWJsZWRcIiAtPiBudWxsXG4gICAgICAgICAgICB9XG5cbiAgICAgICAgICAtIHNlY3JldF9zY2FubmluZ19wdXNoX3Byb3RlY3Rpb24ge1xuICAgICAgICAgICAgICAtIHN0YXR1cyA9IFwiZGlzYWJsZWRcIiAtPiBudWxsXG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXYgd2lsbCBiZSBkZXN0cm95ZWRcbiAgIyAoYmVjYXVzZSBtb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0gaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXG4gIC0gcmVzb3VyY2UgXCJnaXRodWJfdGVhbV9yZXBvc2l0b3J5XCIgXCJkZXZcIiB7XG4gICAgICAtIGV0YWcgICAgICAgPSBcIlcvXFxcIjgwNDNmODFiMTk2OTNmNmMxYTcyZDIxYmI4ZGMwMzg1OWM5OGJmNzhiZmJlNzk3ODJiZmUxM2ZhODEzOTkyY2FcXFwiXCIgLT4gbnVsbFxuICAgICAgLSBpZCAgICAgICAgID0gXCI3MzMyODE1OmNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiIC0+IG51bGxcbiAgICAgIC0gcGVybWlzc2lvbiA9IFwicHVzaFwiIC0+IG51bGxcbiAgICAgIC0gcmVwb3NpdG9yeSA9IFwiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCIgLT4gbnVsbFxuICAgICAgLSB0ZWFtX2lkICAgID0gXCI3MzMyODE1XCIgLT4gbnVsbFxuICAgIH1cblxuICAjIG1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuICB+IHJlc291cmNlIFwiZ2l0aHViX3JlcG9zaXRvcnlcIiBcInJlcG9cIiB7XG4gICAgICB+IGRlc2NyaXB0aW9uICAgICAgICAgICAgICAgICA9IFwiSW5mcmFIb3VzZSBUb29sa2l0XCIgLT4gXCJJbmZyYUhvdXNlIFRvb2xraXQxXCJcbiAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLXRvb2xraXRcIlxuICAgICAgICBuYW1lICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtdG9vbGtpdFwiXG4gICAgICAgICMgKDMxIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcblxuICAgICAgICAjICgxIHVuY2hhbmdlZCBibG9jayBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1widGVzdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiZ2l0aHViX3JlcG9zaXRvcnlcIiBcInJlcG9cIiB7XG4gICAgICArIGFsbG93X2F1dG9fbWVyZ2UgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIGFsbG93X21lcmdlX2NvbW1pdCAgICAgICAgICA9IHRydWVcbiAgICAgICsgYWxsb3dfcmViYXNlX21lcmdlICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBhbGxvd19zcXVhc2hfbWVyZ2UgICAgICAgICAgPSB0cnVlXG4gICAgICArIGFyY2hpdmVkICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIGRlZmF1bHRfYnJhbmNoICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZGVsZXRlX2JyYW5jaF9vbl9tZXJnZSAgICAgID0gZmFsc2VcbiAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICAgICAgID0gXCJUZW1wbGF0ZSBmb3IgYSBHaXRIdWIgQ29udHJvbCByZXBvc2l0b3J5XCJcbiAgICAgICsgZXRhZyAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBmdWxsX25hbWUgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGdpdF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaGFzX2lzc3VlcyAgICAgICAgICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBodG1sX3VybCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGh0dHBfY2xvbmVfdXJsICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBtZXJnZV9jb21taXRfbWVzc2FnZSAgICAgICAgPSBcIlBSX1RJVExFXCJcbiAgICAgICsgbWVyZ2VfY29tbWl0X3RpdGxlICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCJcbiAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ0ZXN0XCJcbiAgICAgICsgbm9kZV9pZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwcml2YXRlICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJlcG9faWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3F1YXNoX21lcmdlX2NvbW1pdF9tZXNzYWdlID0gXCJDT01NSVRfTUVTU0FHRVNcIlxuICAgICAgKyBzcXVhc2hfbWVyZ2VfY29tbWl0X3RpdGxlICAgPSBcIkNPTU1JVF9PUl9QUl9USVRMRVwiXG4gICAgICArIHNzaF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3ZuX3VybCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB2aXNpYmlsaXR5ICAgICAgICAgICAgICAgICAgPSBcInB1YmxpY1wiXG5cbiAgICAgICsgc2VjdXJpdHlfYW5kX2FuYWx5c2lzIHtcbiAgICAgICAgICArIGFkdmFuY2VkX3NlY3VyaXR5IHtcbiAgICAgICAgICAgICAgKyBzdGF0dXMgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICB9XG5cbiAgICAgICAgICArIHNlY3JldF9zY2FubmluZyB7XG4gICAgICAgICAgICAgICsgc3RhdHVzID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgfVxuXG4gICAgICAgICAgKyBzZWNyZXRfc2Nhbm5pbmdfcHVzaF9wcm90ZWN0aW9uIHtcbiAgICAgICAgICAgICAgKyBzdGF0dXMgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJ0ZXN0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2IHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiZ2l0aHViX3RlYW1fcmVwb3NpdG9yeVwiIFwiZGV2XCIge1xuICAgICAgKyBldGFnICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwZXJtaXNzaW9uID0gXCJwdXNoXCJcbiAgICAgICsgcmVwb3NpdG9yeSA9IFwidGVzdFwiXG4gICAgICArIHRlYW1faWQgICAgPSBcIjczMzI4MTVcIlxuICAgIH1cblxuUGxhbjogMiB0byBhZGQsIDEgdG8gY2hhbmdlLCAyIHRvIGRlc3Ryb3kuXG5cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIiLCAic3RkZXJyIjogbnVsbCwgImFkZCI6IDIsICJjaGFuZ2UiOiAxLCAiZGVzdHJveSI6IDJ9fQ==
```
</details>